[
  {
    "id": "1",
    "slug": "elsa-performance",
    "title": "ElsaPerformance — OpenClaw Optimization",
    "shortDescription": "OpenClaw AI gateway performance monitoring, configuration management, and multi-agent orchestration optimization platform.",
    "description": "ElsaPerformance is the meta-project tracking the health, optimization, and evolution of Elsa's own OpenClaw runtime. It covers gateway configuration (openclaw.json), session context management with 100k token threshold alerts, multi-agent coordination protocols, and integration health checks across Home Assistant, Garmin, Google Workspace, and Notion. The project produced the Workspace Blueprint v2 — standardizing directory structure, cron scheduling, security hardening with FileVault and macOS Firewall, and the PROTOCOL_AGENTS.md multi-agent operation standard. Elsa runs daily health checks, manages API fallback strategies between Anthropic and Google Gemini, and maintains comprehensive performance logs.",
    "techStack": ["OpenClaw", "Claude API", "Node.js", "Shell Script", "Home Assistant", "Garmin API", "Google Workspace API", "Notion API"],
    "status": "Active",
    "category": "AI",
    "date": "2026-02-15",
    "githubUrl": "",
    "liveDemo": "",
    "thumbnail": "/images/elsa-performance-thumb.svg",
    "screenshots": [
      "/images/elsa-performance-1.svg",
      "/images/elsa-performance-2.svg",
      "/images/elsa-performance-3.svg"
    ],
    "features": [
      "OpenClaw gateway config management with hot-reload and health checks",
      "Multi-agent protocol: Coordinator (Elsa) + ephemeral workers (Jarvis, Anna) with fail-fast rules",
      "Context window monitoring: 60k/80k/100k threshold alerts and pre-reset checklist",
      "API fallback strategy: Anthropic → Google Gemini seamless model switching",
      "Weekly security audit, FileVault encryption, macOS Firewall enforcement",
      "Workspace Blueprint v2: standardized directory structure across all projects"
    ],
    "featured": true
  },
  {
    "id": "2",
    "slug": "autonomous-coding-agent",
    "title": "AutonomousCodingAgent",
    "shortDescription": "A self-evolving AI engineering unit capable of end-to-end software synthesis.",
    "description": "The AutonomousCodingAgent represents the pinnacle of AI-driven engineering. This system isn't just a helper; it's a fully integrated developer that manages the entire lifecycle of software creation—from requirement extraction and architectural design to polyglot code generation, automated CI/CD, and live deployment. This portfolio itself is a living proof of its autonomous capabilities.",
    "techStack": ["TypeScript", "Python", "Claude 3.5 Sonnet", "Gemini 1.5 Pro", "Next.js", "Docker"],
    "status": "Active",
    "category": "AI",
    "date": "2024-03-01",
    "githubUrl": "https://github.com/team-elsa-jarvis/autonomous-coding-agent",
    "liveDemo": "https://autonomous-agent.demo.com",
    "thumbnail": "/images/autonomous-agent-thumb.svg",
    "screenshots": [
      "/images/autonomous-agent-1.svg",
      "/images/autonomous-agent-2.svg"
    ],
    "features": [
      "Full-stack autonomous synthesis from natural language blueprints",
      "Multi-agent collaborative architecture: Architect, Coder, Reviewer, and SRE roles",
      "Advanced self-debugging via iterative recursive loops and symbolic execution",
      "Seamless integration with enterprise Git workflows and PR automation",
      "Dynamic context management across million-line codebases",
      "Framework-agnostic generation respecting project-specific design patterns",
      "Automated high-coverage unit, integration, and E2E test suite synthesis",
      "Continuous evolutionary learning from repository history and human-in-the-loop feedback"
    ],
    "featured": true
  },
  {
    "id": "3",
    "slug": "axon-ai",
    "title": "AxonAI — Axon AI Model™",
    "shortDescription": "A strategic AI transformation framework embedding autonomous agents into the Axon Active Agile development cycle.",
    "description": "AxonAI redefines how offshore development teams operate by embedding AI tools—GitHub Copilot, Cursor, and Claude Code—directly into Axon Active's proprietary Scrum-based Axon Model™. The project produced the Axon AI Model™, a layered framework that reshapes developer roles into AI Pilots, Scrum Masters into AI-Enhanced Facilitators, and Product Owners into Value Engineers, with governance cycles spanning PO, EAT, and EMS levels. Research deliverables include a sales pitch for prospective clients, a 1000+ word strategic proposal for existing customers, and an internal staff guidebook featuring the 3-Prompt Rule and a Junior Gap apprenticeship solution. The enterprise governance layer addresses Private LLM policy, IP protection, and Copilot Enterprise rollout strategy across dedicated offshore teams.",
    "techStack": ["Python", "Claude API", "Notion API", "Google Drive API", "Anthropic SDK", "Markdown"],
    "status": "Active",
    "category": "AI",
    "date": "2026-02-15",
    "githubUrl": "",
    "liveDemo": "",
    "thumbnail": "/images/axon-ai-thumb.svg",
    "screenshots": [
      "/images/axon-ai-1.svg",
      "/images/axon-ai-2.svg"
    ],
    "features": [
      "Axon AI Model™ framework defining role shifts for all Scrum personas (Developer → AI Pilot, SM → AI-Enhanced Facilitator, PO → Value Engineer)",
      "Agentic SDLC workflow mapping GitHub Copilot, Cursor, and Claude Code to each sprint phase",
      "Sales pitch and 1000+ word strategic proposal documents published and synchronized to Notion",
      "Internal staff guidebook: AI-First Onboarding, Pair Programming 2.0, and the 3-Prompt Rule",
      "Junior Gap solution: AI-assisted apprenticeship model bridging skill gaps for junior developers",
      "Enterprise governance layer: Private LLM policy, IP protection standards, and Copilot Enterprise adoption guidance"
    ],
    "featured": true
  },
  {
    "id": "4",
    "slug": "devday-2026",
    "title": "DevDay 2026 — AI x Human",
    "shortDescription": "Event planning and content management system for Da Nang's largest annual tech conference, themed 'AI x Human: The Future of Co-Intelligence.'",
    "description": "DevDay is a non-profit annual tech conference co-organized by Axon Active and Duy Tan University in Da Nang, and the 2026 edition on April 18 at Duy Tan University targets 3000+ attendees including students, IT professionals, business leaders, and investors. Elsa serves as the AI management assistant orchestrating agenda planning, Notion page synchronization, speaker registration tracking with a March 5 deadline, and workshop and panel session design across six AI topic tracks. The conference theme 'AI x Human: The Future of Co-Intelligence' centers on the co-existence of human creativity and machine intelligence, featuring C-level panel discussions and 14 technical workshop slots. All event data, partner information, and task workflows are managed through a centralized Elsa-maintained Notion workspace.",
    "techStack": ["Notion API", "Google Calendar API", "Google Drive API", "OpenClaw", "Claude API"],
    "status": "Active",
    "category": "Web",
    "date": "2026-02-15",
    "githubUrl": "",
    "liveDemo": "",
    "thumbnail": "/images/devday-2026-thumb.svg",
    "screenshots": [
      "/images/devday-2026-1.svg",
      "/images/devday-2026-2.svg"
    ],
    "features": [
      "Automated agenda generation and real-time Notion page synchronization for the April 18, 2026 event",
      "Call for Speakers tracking with deadline management (March 5, 2026) and applicant pipeline",
      "Panel Discussion design and facilitation planning for 2 C-level executive sessions",
      "Workshop review criteria management for 14 technical slots across 6 AI topic tracks",
      "Event information hub: partner data (AgilityIO, Enosta, NTT Data), timeline, and venue logistics",
      "Elsa-managed task board in Notion To-Do List database with status tracking and automated reminders"
    ],
    "featured": true
  }
]
