[
  {
    "id": "1",
    "slug": "elsa-openclaw",
    "title": "Elsa OpenClaw",
    "shortDescription": "The AI coordinator system powering the Super Agents team — built on OpenClaw.",
    "description": "<h3>About Elsa OpenClaw</h3><p>Elsa is an advanced agent framework built on the <strong>CAP/4.1 protocol</strong> (Capability Assertion Protocol), designed to orchestrate complex, multi-step workflows with graceful error handling and autonomous decision-making. Running on OpenClaw's infrastructure, Elsa powers robust automation tasks across code deployment, system maintenance, documentation, and research workflows.</p><h3>CAP/4.1 Architecture</h3><p>The system operates on a refined capability model where <strong>protocol design supersedes raw model power</strong>—validated through LongCLI-Bench benchmarks showing SOTA agents achieve &lt;20% pass rates without proper protocol infrastructure. Elsa defaults to <strong>Claude Haiku 4.5</strong> for efficiency and cost-effectiveness, with automatic escalation to <strong>Claude Sonnet 4.6</strong> for complex reasoning tasks. All agents (Elsa, Jarvis, Anna, and scripts) follow this model policy consistently.</p><h3>Dual-Set Verification & Regression Prevention</h3><p>Every critical task undergoes <strong>dual-set verification</strong>: F2P (first-pass testing) and P2P (peer-pass testing) to detect regressions early. The system acknowledges SOTA regression risk of 12-30% and combats this through structured testing, artifact memory capture, and continuous audit cycles. A full system maintenance audit conducted on 2026-02-21 confirmed 0 FAILs, 0 WARNINGs, and 40 PASSes across all subsystems.</p><h3>Environment-Grounded Execution</h3><p>Elsa enforces mandatory diagnosis before any code modification, captured in structured artifacts: <strong>plan.json</strong> (pre-task planning), <strong>diagnose_evidence.json</strong> (environment state and constraints), and <strong>verify.json</strong> (post-execution validation). This discipline ensures decisions remain grounded in actual system state, not assumptions. The <strong>Early Loop Breaker</strong> pattern prevents infinite loops: 2x same error triggers escalation; 3x error logs as BLOCKED.</p><h3>Active System Maintenance</h3><p>The framework runs 5 active cron jobs managing system health: morning-reset (refresh session state), daily-backup (automated persistence), weekly-cleanup (storage optimization), hass-db-maintenance (Home Assistant database hygiene), and weekly-audit (compliance verification). Workspace Blueprint v2 organizes artifacts into brain (2.6MB core memory) and ~/Projects/ (code output directory), enabling scalable knowledge retention across agent sessions.</p><h3>Modern Tech Stack & Integrations</h3><p>Built on OpenClaw with Claude Haiku 4.5 and Sonnet 4.6, Elsa integrates <strong>Prisma + SQLite</strong> for data persistence, <strong>Next.js 14</strong> for web interfaces, shell scripting and Python for system automation, <strong>GitHub CLI</strong> for version control, <strong>Notion API</strong> for documentation workflows, and <strong>Home Assistant</strong> for IoT automation. This multi-tool ecosystem enables Elsa to dispatch specialized subagents (like Anna) for parallel research, content creation, and cross-platform task orchestration.</p>",
    "techStack": [
      "OpenClaw",
      "Claude Haiku 4.5",
      "Claude Sonnet 4.6",
      "CAP/4.1",
      "Prisma",
      "SQLite",
      "Next.js 14",
      "Shell Script",
      "Python",
      "GitHub CLI",
      "Notion API",
      "Home Assistant"
    ],
    "status": "Active",
    "category": "AI",
    "date": "2026-02-21",
    "githubUrl": "",
    "liveDemo": "",
    "thumbnail": "/images/elsa-openclaw-thumb.svg",
    "screenshots": [
      "/images/elsa-openclaw-1.svg",
      "/images/elsa-openclaw-2.svg",
      "/images/elsa-openclaw-3.svg"
    ],
    "features": [
      "CAP/4.1 protocol-driven agent architecture with automatic capability assertion",
      "Dual-model execution: Claude Haiku 4.5 (default) with Sonnet 4.6 self-escalation",
      "LongCLI-Bench validated design achieving SOTA performance without raw model dependency",
      "Dual-set verification (F2P + P2P) with 12-30% regression detection coverage",
      "Environment-grounded execution with mandatory pre-task diagnosis",
      "Artifact memory system: plan.json, diagnose_evidence.json, verify.json for audit trails",
      "Early Loop Breaker pattern: 2x error escalation, 3x error blocking",
      "Ephemeral subagent spawning for parallel research and specialized workflows",
      "5 active cron jobs for autonomous system maintenance and health checks",
      "Workspace Blueprint v2 with brain (core memory) and code output separation",
      "Full system audit transparency: 2026-02-21 audit showed 0 FAIL / 0 WARN / 40 PASS",
      "Seamless GitHub CLI, Notion API, and Home Assistant integrations",
      "SQLite + Prisma ORM for reliable data persistence and schema management",
      "Shell script and Python automation for cross-platform system tasks",
      "Next.js 14 frontend for web-based task management and monitoring",
      "Graceful error handling with structured diagnosis before escalation",
      "Multi-agent orchestration enabling research (Anna), code (Jarvis), and CLI (Elsa) specialization",
      "Cost-effective operation leveraging Haiku as primary execution model",
      "Production-ready audit logging and compliance verification workflows"
    ],
    "featured": true
  },
  {
    "id": "2",
    "slug": "autonomous-coding-agent",
    "title": "Autonomous Coding Agent",
    "shortDescription": "A multi-agent system (Elsa, Jarvis, Anna) using the CAP v3.2 protocol for autonomous software engineering and research.",
    "description": "The Autonomous Coding Agent system operates with Elsa as Coordinator, Jarvis as Technical Worker, and Anna as Research/Content Worker, collaborating via the Canonical Agent Protocol (CAP) v3.2. Tasks are managed through DISPATCH, REPORT, BLOCKED, and CLARIFY envelopes, ensuring high reliability and fail-fast error handling. The system features a multi-tier Execution Firewall for safety, was used to build this very portfolio, and utilizes a routing matrix to optimize performance and costs across various AI models.",
    "techStack": [
      "TypeScript",
      "Next.js",
      "Prisma",
      "SQLite",
      "Claude Sonnet 4.6",
      "Claude Haiku 4.5",
      "Gemini Flash 3",
      "OpenClaw",
      "Python"
    ],
    "status": "Active",
    "category": "AI",
    "date": "2026-02-18",
    "githubUrl": "https://github.com/dangochai/project-portfolio",
    "liveDemo": "http://192.168.86.41:3001",
    "thumbnail": "/images/project-portfolio-thumb.svg",
    "screenshots": [
      "/images/project-portfolio-1.svg",
      "/images/project-portfolio-2.svg"
    ],
    "features": [
      "CAP v3.2 protocol: Model-agnostic communication using structured DISPATCH/REPORT envelopes",
      "Routing matrix: Intelligent task allocation to optimize cost and performance (Haiku for code, Flash for scans)",
      "Execution Firewall: Multi-tier safety layer governing autonomous database and shell access",
      "Sequential-first spawn policy: Reliable task execution with isolated parallel paths when safe",
      "BLOCKED handler with error taxonomy: Advanced error classification for fast recovery and escalation",
      "Cost optimization: Targeted model routing using Claude Sonnet 4.6, Haiku 4.5, and Gemini Flash 3"
    ],
    "featured": true
  },
  {
    "id": "3",
    "slug": "axon-ai",
    "title": "Axon AI Model™",
    "shortDescription": "A strategic AI transformation framework embedding autonomous agents into the Axon Active Agile development cycle.",
    "description": "AxonAI redefines how offshore development teams operate by embedding AI tools—GitHub Copilot, Cursor, and Claude Code—directly into Axon Active's proprietary Scrum-based Axon Model™. The project produced the Axon AI Model™, a layered framework that reshapes developer roles into AI Pilots, Scrum Masters into AI-Enhanced Facilitators, and Product Owners into Value Engineers, with governance cycles spanning PO, EAT, and EMS levels. Research deliverables include a sales pitch for prospective clients, a 1000+ word strategic proposal for existing customers, and an internal staff guidebook featuring the 3-Prompt Rule and a Junior Gap apprenticeship solution. The enterprise governance layer addresses Private LLM policy, IP protection, and Copilot Enterprise rollout strategy across dedicated offshore teams.",
    "techStack": [
      "Python",
      "Claude API",
      "Notion API",
      "Google Drive API",
      "Anthropic SDK",
      "Markdown"
    ],
    "status": "Active",
    "category": "AI",
    "date": "2026-02-15",
    "githubUrl": "",
    "liveDemo": "",
    "thumbnail": "/images/axon-ai-thumb.svg",
    "screenshots": [
      "/images/axon-ai-1.svg",
      "/images/axon-ai-2.svg"
    ],
    "features": [
      "Axon AI Model™ framework defining role shifts for all Scrum personas (Developer → AI Pilot, SM → AI-Enhanced Facilitator, PO → Value Engineer)",
      "Agentic SDLC workflow mapping GitHub Copilot, Cursor, and Claude Code to each sprint phase",
      "Sales pitch and 1000+ word strategic proposal documents published and synchronized to Notion",
      "Internal staff guidebook: AI-First Onboarding, Pair Programming 2.0, and the 3-Prompt Rule",
      "Junior Gap solution: AI-assisted apprenticeship model bridging skill gaps for junior developers",
      "Enterprise governance layer: Private LLM policy, IP protection standards, and Copilot Enterprise adoption guidance"
    ],
    "featured": true
  },
  {
    "id": "4",
    "slug": "devday-2026",
    "title": "DevDay 2026",
    "shortDescription": "Vietnam's premier non-profit IT festival — AI x Human: Redefining Collaboration. April 18, 2026 at Duy Tan University, Da Nang.",
    "description": "<p><strong>DevDay Da Nang</strong> is Vietnam's premier non-profit information technology festival, organized annually by <strong>Axon Active</strong> and <strong>Duy Tan University</strong>. Founded in 2014, it has grown from a local developer meetup into one of Southeast Asia's most influential tech gatherings, attracting 3,000+ participants and 40+ international speakers each year.</p>\n\n<h3>DevDay 2026: AI x Human — Redefining Collaboration</h3>\n<p>Scheduled for <strong>April 18, 2026</strong> at Duy Tan University (03 Quang Trung, Da Nang), the 2026 edition centers on <em>\"AI x Human: Redefining Collaboration\"</em> — exploring how human creativity and machine intelligence work together rather than compete. DevDay positions AI as a collaborative partner that amplifies human potential, not a replacement.</p>\n\n<h3>Event Structure</h3>\n<p>The event runs 6 specialized concurrent tracks: <strong>AI &amp; Intelligent Systems</strong>, <strong>Web3 &amp; Blockchain</strong>, <strong>Software Engineering</strong>, <strong>Cybersecurity &amp; Data Protection</strong>, <strong>Enterprise Transformation</strong>, and <strong>Emerging Technologies</strong>. The program includes keynote sessions, hands-on workshops, startup pitch competitions, a career fair (50+ companies), and the legendary informal networking that defines the \"DevDay Spirit.\"</p>\n\n<h3>History &amp; Community Impact</h3>\n<p>DevDay celebrated its <strong>10-year anniversary in 2025</strong> with 3,000+ participants, 40 speakers, 38 session topics, 21 exhibitors, and 10 major sponsors. The event is backed by the Da Nang Department of Science &amp; Technology and has hosted delegations from the Swiss Confederation Embassy — evidence of its growing international reputation. Da Nang's position as Vietnam's rising technology hub outside Hanoi and HCMC is inseparable from DevDay's decade of community building.</p>\n\n<h3>AI Team Support</h3>\n<p>DevDay 2026 is supported by an AI planning team — <strong>Elsa</strong> (Strategic Orchestrator), <strong>Jarvis</strong> (Technical Specialist), and <strong>Anna</strong> (Content &amp; Research Coordinator) — working alongside Axon Active's human organizers to manage content curation, speaker research, and community documentation. This collaboration itself embodies the event's theme of human-AI co-intelligence in practice.</p>",
    "techStack": [
      "Notion API",
      "Google Calendar API",
      "Google Drive API",
      "OpenClaw",
      "Claude API"
    ],
    "status": "Active",
    "category": "Web",
    "date": "2026-02-15",
    "githubUrl": "",
    "liveDemo": "",
    "thumbnail": "/images/devday-2026-thumb.svg",
    "screenshots": [
      "/images/devday-2026-1.svg",
      "/images/devday-2026-2.svg"
    ],
    "features": [
      "Theme: \"AI x Human: Redefining Collaboration\" — April 18, 2026, Duy Tan University, Da Nang.",
      "Scale: 3,000+ attendees, 40+ international speakers, 21 exhibitors, 10 major sponsors (2025 benchmark).",
      "Program: 6 specialized tracks — AI/ML, Web3, Software Engineering, Cybersecurity, Enterprise Transformation, Emerging Tech.",
      "History: Founded 2014 by Axon Active & Duy Tan University — 11+ years of non-profit, community-driven innovation.",
      "Career Fair: 50+ companies recruiting AI-native developers, engineers, and product managers.",
      "AI Team: Elsa, Jarvis & Anna orchestrate planning, research, and content — a live demonstration of the event theme."
    ],
    "featured": true
  }
]