[
  {
    "id": "1",
    "slug": "elsa-performance",
    "title": "Elsa OpenClaw",
    "shortDescription": "The AI coordinator system powering the Super Agents team — built on OpenClaw.",
    "description": "<p>Elsa is the mission-critical orchestration layer of the Super Agents ecosystem. Built on the <strong>OpenClaw</strong> framework, she serves as the central nervous system for an autonomous workforce, transforming a collection of AI models into a cohesive, high-performance team.</p><h3>1. Multi-Agent Architecture & Protocol</h3><p>At her core, Elsa manages a specialized team of ephemeral sub-agents. Communication is standardized via <strong>CAP/3.1</strong> (Canonical Agent Protocol), a model-agnostic standard designed by Elsa to handle complex task dispatching and error escalation.</p><ul><li><strong>Elsa (Coordinator):</strong> Powered by Claude 4.6/Sonnet 4.5, handles high-level decision-making and human interaction.</li><li><strong>Jarvis (Technical Specialist):</strong> Optimized on Gemini Flash for DevOps, coding, and system operations.</li><li><strong>Anna (Research & Content):</strong> Specialized in documentation, Notion management, and data analysis.</li></ul><h3>2. Automated Operations & Maintenance</h3><p>The system is built for 'zero-touch' reliability. Elsa manages her own health through a suite of automated maintenance scripts:</p><ul><li><strong>Health Monitoring:</strong> Real-time connectivity checks for Home Assistant, Notion, and Google Workspace.</li><li><strong>Daily Resilience:</strong> Automatic daily and weekly backups to a private GitHub repository (elsa-openclaw) and Google Drive.</li><li><strong>Cron Orchestration:</strong> 13+ active cron jobs managing everything from Garmin health briefings to security audits.</li></ul><h3>3. Workspace Isolation & Architecture</h3><p>To ensure maximum efficiency and security, the system implements <strong>Workspace Isolation</strong>. By moving project outputs out of the core OpenClaw workspace, the 'brain' remains lightweight and performant.</p><ul><li><strong>New Architecture Rule:</strong> workspace=brain, ~/Projects/=output.</li><li><strong>99.7% Size Reduction:</strong> Workspace footprint reduced from 775MB to 2.6MB by offloading static project data to ~/Projects/.</li><li><strong>Automated Lifecycle:</strong> Cleanup scripts (weekly cron) now cover both the core workspace and ~/Projects/ for end-to-end maintenance.</li></ul><h3>4. Security & The Execution Firewall</h3><p>Safety is non-negotiable. Elsa implements a <strong>3-tier Execution Firewall</strong> that governs how agents interact with the host system. This ensures that while agents have the power to write code and manage databases (via Prisma/SQLite), they are strictly prohibited from destructive or unauthorized external actions.</p><h3>5. Self-Evolution (Blueprint v2)</h3><p>Using the <strong>Workspace Blueprint v2</strong>, Elsa maintains a self-documenting environment. She is capable of refactoring her own scripts, updating project schemas, and maintaining a clean, professional workspace. This self-improving loop ensures the system evolves alongside the user's needs.</p>",
    "techStack": [
      "OpenClaw",
      "Claude Sonnet 4.6",
      "Gemini Flash",
      "CAP/3.1",
      "Prisma",
      "SQLite",
      "Shell Script",
      "Python",
      "GitHub CLI",
      "Notion API",
      "Home Assistant"
    ],
    "status": "Active",
    "category": "AI",
    "date": "2026-02-18",
    "githubUrl": "",
    "liveDemo": "",
    "thumbnail": "/images/elsa-openclaw-thumb.svg",
    "screenshots": [
      "/images/elsa-openclaw-1.svg",
      "/images/elsa-openclaw-2.svg",
      "/images/elsa-openclaw-3.svg"
    ],
    "features": [
      "CAP/3.1 model-agnostic agent protocol with DISPATCH/REPORT envelopes",
      "Multi-agent coordination: Elsa (Coordinator), Jarvis (Tech), Anna (Content)",
      "Workspace isolation: projects moved to ~/Projects/, reducing workspace from 775MB to 2.6MB (99.7%)",
      "Automated cleanup script covers both workspace + ~/Projects/ (weekly cron)",
      "New architecture rule: workspace=brain, ~/Projects/=output",
      "3-tier Execution Firewall for safe autonomous database and shell access",
      "Automated daily backups to private GitHub repo (elsa-openclaw) and GDrive",
      "Workspace Blueprint v2: Organized system scripts and memory architecture",
      "Real-world integrations: Garmin health briefings and Home Assistant control",
      "Self-documenting and self-evolving system via iterative PR workflows",
      "SQLite + Prisma 6.4.0 backend for persistent agent memory and state"
    ],
    "featured": true
  },
  {
    "id": "2",
    "slug": "autonomous-coding-agent",
    "title": "Autonomous Coding Agent",
    "shortDescription": "A multi-agent system (Elsa, Jarvis, Anna) using the CAP v3.2 protocol for autonomous software engineering and research.",
    "description": "The Autonomous Coding Agent system operates with Elsa as Coordinator, Jarvis as Technical Worker, and Anna as Research/Content Worker, collaborating via the Canonical Agent Protocol (CAP) v3.2. Tasks are managed through DISPATCH, REPORT, BLOCKED, and CLARIFY envelopes, ensuring high reliability and fail-fast error handling. The system features a multi-tier Execution Firewall for safety, was used to build this very portfolio, and utilizes a routing matrix to optimize performance and costs across various AI models.",
    "techStack": [
      "TypeScript",
      "Next.js",
      "Prisma",
      "SQLite",
      "Claude Sonnet 4.6",
      "Claude Haiku 4.5",
      "Gemini Flash 3",
      "OpenClaw",
      "Python"
    ],
    "status": "Active",
    "category": "AI",
    "date": "2026-02-18",
    "githubUrl": "https://github.com/dangochai/elsa-openclaw",
    "liveDemo": "http://192.168.86.41:3001",
    "thumbnail": "/images/project-portfolio-thumb.svg",
    "screenshots": [
      "/images/project-portfolio-1.svg",
      "/images/project-portfolio-2.svg"
    ],
    "features": [
      "CAP v3.2 protocol: Model-agnostic communication using structured DISPATCH/REPORT envelopes",
      "Routing matrix: Intelligent task allocation to optimize cost and performance (Haiku for code, Flash for scans)",
      "Execution Firewall: Multi-tier safety layer governing autonomous database and shell access",
      "Sequential-first spawn policy: Reliable task execution with isolated parallel paths when safe",
      "BLOCKED handler with error taxonomy: Advanced error classification for fast recovery and escalation",
      "Cost optimization: Targeted model routing using Claude Sonnet 4.6, Haiku 4.5, and Gemini Flash 3"
    ],
    "featured": true
  },
  {
    "id": "3",
    "slug": "axon-ai",
    "title": "Axon AI Model™",
    "shortDescription": "A strategic AI transformation framework embedding autonomous agents into the Axon Active Agile development cycle.",
    "description": "AxonAI redefines how offshore development teams operate by embedding AI tools—GitHub Copilot, Cursor, and Claude Code—directly into Axon Active's proprietary Scrum-based Axon Model™. The project produced the Axon AI Model™, a layered framework that reshapes developer roles into AI Pilots, Scrum Masters into AI-Enhanced Facilitators, and Product Owners into Value Engineers, with governance cycles spanning PO, EAT, and EMS levels. Research deliverables include a sales pitch for prospective clients, a 1000+ word strategic proposal for existing customers, and an internal staff guidebook featuring the 3-Prompt Rule and a Junior Gap apprenticeship solution. The enterprise governance layer addresses Private LLM policy, IP protection, and Copilot Enterprise rollout strategy across dedicated offshore teams.",
    "techStack": [
      "Python",
      "Claude API",
      "Notion API",
      "Google Drive API",
      "Anthropic SDK",
      "Markdown"
    ],
    "status": "Active",
    "category": "AI",
    "date": "2026-02-15",
    "githubUrl": "",
    "liveDemo": "",
    "thumbnail": "/images/axon-ai-thumb.svg",
    "screenshots": [
      "/images/axon-ai-1.svg",
      "/images/axon-ai-2.svg"
    ],
    "features": [
      "Axon AI Model™ framework defining role shifts for all Scrum personas (Developer → AI Pilot, SM → AI-Enhanced Facilitator, PO → Value Engineer)",
      "Agentic SDLC workflow mapping GitHub Copilot, Cursor, and Claude Code to each sprint phase",
      "Sales pitch and 1000+ word strategic proposal documents published and synchronized to Notion",
      "Internal staff guidebook: AI-First Onboarding, Pair Programming 2.0, and the 3-Prompt Rule",
      "Junior Gap solution: AI-assisted apprenticeship model bridging skill gaps for junior developers",
      "Enterprise governance layer: Private LLM policy, IP protection standards, and Copilot Enterprise adoption guidance"
    ],
    "featured": true
  },
  {
    "id": "4",
    "slug": "devday-2026",
    "title": "DevDay 2026",
    "shortDescription": "Event planning and content management system for Da Nang's largest annual tech conference, themed 'AI x Human: The Future of Co-Intelligence.'",
    "description": "DevDay Da Nang 2026 is Vietnam's premier non-profit IT festival, gathering over 3,000 tech enthusiasts to explore the 'AI x Human' paradigm. Hosted at Duy Tan University, the event features 40+ global speakers across specialized tracks, showcasing the future of co-intelligence, automation workflows, and AI-driven innovation.",
    "techStack": [
      "Notion API",
      "Google Calendar API",
      "Google Drive API",
      "OpenClaw",
      "Claude API"
    ],
    "status": "Active",
    "category": "Web",
    "date": "2026-02-15",
    "githubUrl": "",
    "liveDemo": "",
    "thumbnail": "/images/devday-2026-thumb.svg",
    "screenshots": [
      "/images/devday-2026-1.svg",
      "/images/devday-2026-2.svg"
    ],
    "features": [
      "Theme: AI x Human: Redefining collaboration in the age of intelligence.",
      "Attendance: 3,000+ developers, entrepreneurs, and students.",
      "Tracks: 6 specialized AI tracks including Autonomous Agents and AI Ethics.",
      "Networking: Exclusive VIP lounge and industry-leading career fair.",
      "Community: Largest non-profit tech gathering in Central Vietnam."
    ],
    "featured": true
  }
]