[
  {
    "id": "1",
    "slug": "elsa-performance",
    "title": "Elsa OpenClaw",
    "shortDescription": "The AI coordinator system powering the Super Agents team — built on OpenClaw.",
    "description": "<p>Elsa is the mission-critical orchestration layer of the Super Agents ecosystem. Built on the <strong>OpenClaw</strong> framework, she serves as the central nervous system for an autonomous workforce, transforming a collection of AI models into a cohesive, high-performance team.</p><h3>1. Multi-Agent Architecture & Protocol</h3><p>At her core, Elsa manages a specialized team of ephemeral sub-agents. Communication is standardized via <strong>CAP/3.2</strong> (Canonical Agent Protocol), a model-agnostic standard designed by Elsa to handle complex task dispatching and error escalation.</p><ul><li><strong>Elsa (Coordinator):</strong> Powered by Claude 4.6/Sonnet 4.5, handles high-level decision-making and human interaction.</li><li><strong>Jarvis (Technical Specialist):</strong> Optimized on Gemini Flash for DevOps, coding, and system operations.</li><li><strong>Anna (Research & Content):</strong> Specialized in documentation, Notion management, and data analysis.</li></ul><h3>2. Automated Operations & Maintenance</h3><p>The system is built for 'zero-touch' reliability. Elsa manages her own health through a suite of automated maintenance scripts:</p><ul><li><strong>Health Monitoring:</strong> Real-time connectivity checks for Home Assistant, Notion, and Google Workspace.</li><li><strong>Daily Resilience:</strong> Automatic daily and weekly backups to a private GitHub repository (elsa-openclaw) and Google Drive.</li><li><strong>Cron Orchestration:</strong> 13+ active cron jobs managing everything from Garmin health briefings to security audits.</li></ul><h3>3. Workspace Isolation & Architecture</h3><p>To ensure maximum efficiency and security, the system implements <strong>Workspace Isolation</strong>. By moving project outputs out of the core OpenClaw workspace, the 'brain' remains lightweight and performant.</p><ul><li><strong>New Architecture Rule:</strong> workspace=brain, ~/Projects/=output.</li><li><strong>99.7% Size Reduction:</strong> Workspace footprint reduced from 775MB to 2.6MB by offloading static project data to ~/Projects/.</li><li><strong>Automated Lifecycle:</strong> Cleanup scripts (weekly cron) now cover both the core workspace and ~/Projects/ for end-to-end maintenance.</li></ul><h3>4. Security & The Execution Firewall</h3><p>Safety is non-negotiable. Elsa implements a <strong>3-tier Execution Firewall</strong> that governs how agents interact with the host system. This ensures that while agents have the power to write code and manage databases (via Prisma/SQLite), they are strictly prohibited from destructive or unauthorized external actions.</p><h3>5. Workspace Health System</h3><p>To ensure long-term stability, Elsa features a comprehensive workspace integrity verification system. This includes <strong>audit_system.sh</strong> for real-time health checks and <strong>WORKSPACE_HEALTH_RULES.md</strong> for prevention of structural regression. This system was instrumental in discovering and resolving a critical workspace nesting bug (workspace/workspace/) that had caused multi-session identity loss. Health reports are now generated in standardized JSON format for continuous monitoring.</p><h3>6. Self-Evolution (Blueprint v2)</h3><p>Using the <strong>Workspace Blueprint v2</strong>, Elsa maintains a self-documenting environment. She is capable of refactoring her own scripts, updating project schemas, and maintaining a clean, professional workspace. This self-improving loop ensures the system evolves alongside the user's needs.</p>\n<h3>7. CAP/3.2 Multi-Agent Protocol (Update 2026-02-19)</h3>\n<p>To optimize performance and minimize costs, Elsa has formalized the <strong>CAP/3.2 (Canonical Agent Protocol)</strong>. This framework governs how the team collaborates with minimal overhead:</p>\n<ul>\n<li><strong>Model-Agnostic DISPATCH/REPORT:</strong> Every task is framed with clear Objectives and Success Criteria, using structured envelopes that work across Claude and Gemini.</li>\n<li><strong>Sequential-First Spawning:</strong> To prevent Git conflicts and API rate limits, Elsa prioritizes sequential task execution, using isolated parallel paths only for independent work.</li>\n<li><strong>Fail-Fast (3-Error Rule):</strong> Agents stop and report immediately after 3 identical errors, preventing hallucination loops and saving budget.</li>\n<li><strong>Token Efficiency:</strong>elsa context is proactively compacted at 40k tokens, and workers default to Gemini Flash, resulting in a 5x cost reduction for routine technical tasks.</li>\n</ul>\n",
    "techStack": [
      "OpenClaw",
      "Claude Sonnet 4.6",
      "Gemini Flash",
      "CAP/3.2",
      "Prisma",
      "SQLite",
      "Shell Script",
      "Python",
      "GitHub CLI",
      "Notion API",
      "Home Assistant"
    ],
    "status": "Active",
    "category": "AI",
    "date": "2026-02-19",
    "githubUrl": "",
    "liveDemo": "",
    "thumbnail": "/images/elsa-openclaw-thumb.svg",
    "screenshots": [
      "/images/elsa-openclaw-1.svg",
      "/images/elsa-openclaw-2.svg",
      "/images/elsa-openclaw-3.svg"
    ],
    "features": [
      "CAP/3.2 model-agnostic agent protocol with DISPATCH/REPORT envelopes",
      "Multi-agent coordination: Elsa (Coordinator), Jarvis (Tech), Anna (Content)",
      "Workspace isolation: projects moved to ~/Projects/, reducing workspace from 775MB to 2.6MB (99.7%)",
      "Automated cleanup script covers both workspace + ~/Projects/ (weekly cron)",
      "New architecture rule: workspace=brain, ~/Projects/=output",
      "3-tier Execution Firewall for safe autonomous database and shell access",
      "Automated daily backups to private GitHub repo (elsa-openclaw) and GDrive",
      "Workspace Blueprint v2: Organized system scripts and memory architecture",
      "Real-world integrations: Garmin health briefings and Home Assistant control",
      "Self-documenting and self-evolving system via iterative PR workflows",
      "SQLite + Prisma 6.4.0 backend for persistent agent memory and state",
      "Workspace Health System: audit_system.sh detects workspace integrity issues, connectivity checks, and cron status",
      "CAP/3.2 GitHub Identity Rules: each agent commits with their dedicated GitHub identity (Elsa/Jarvis/Anna)",
      "Critical workspace nesting fix (2026-02-19): resolved multi-session identity loss caused by workspace/workspace/ structure",
      "CAP/3.2 Sequential-First Spawning policy: prevents git conflicts and API rate limits",
      "Fail-Fast 3-Error Rule: agents stop immediately to prevent hallucination loops",
      "Active context management: proactive compaction at 40k tokens to minimize turn costs",
      "Multi-agent GitHub integration: distinct SSH hosts and identities for Elsa, Jarvis, and Anna"
    ],
    "featured": true
  },
  {
    "id": "2",
    "slug": "autonomous-coding-agent",
    "title": "Autonomous Coding Agent",
    "shortDescription": "A multi-agent system (Elsa, Jarvis, Anna) using the CAP v3.2 protocol for autonomous software engineering and research.",
    "description": "The Autonomous Coding Agent system operates with Elsa as Coordinator, Jarvis as Technical Worker, and Anna as Research/Content Worker, collaborating via the Canonical Agent Protocol (CAP) v3.2. Tasks are managed through DISPATCH, REPORT, BLOCKED, and CLARIFY envelopes, ensuring high reliability and fail-fast error handling. The system features a multi-tier Execution Firewall for safety, was used to build this very portfolio, and utilizes a routing matrix to optimize performance and costs across various AI models.",
    "techStack": [
      "TypeScript",
      "Next.js",
      "Prisma",
      "SQLite",
      "Claude Sonnet 4.6",
      "Claude Haiku 4.5",
      "Gemini Flash 3",
      "OpenClaw",
      "Python"
    ],
    "status": "Active",
    "category": "AI",
    "date": "2026-02-18",
    "githubUrl": "https://github.com/dangochai/project-portfolio",
    "liveDemo": "http://192.168.86.41:3001",
    "thumbnail": "/images/project-portfolio-thumb.svg",
    "screenshots": [
      "/images/project-portfolio-1.svg",
      "/images/project-portfolio-2.svg"
    ],
    "features": [
      "CAP v3.2 protocol: Model-agnostic communication using structured DISPATCH/REPORT envelopes",
      "Routing matrix: Intelligent task allocation to optimize cost and performance (Haiku for code, Flash for scans)",
      "Execution Firewall: Multi-tier safety layer governing autonomous database and shell access",
      "Sequential-first spawn policy: Reliable task execution with isolated parallel paths when safe",
      "BLOCKED handler with error taxonomy: Advanced error classification for fast recovery and escalation",
      "Cost optimization: Targeted model routing using Claude Sonnet 4.6, Haiku 4.5, and Gemini Flash 3"
    ],
    "featured": true
  },
  {
    "id": "3",
    "slug": "axon-ai",
    "title": "Axon AI Model™",
    "shortDescription": "A strategic AI transformation framework embedding autonomous agents into the Axon Active Agile development cycle.",
    "description": "AxonAI redefines how offshore development teams operate by embedding AI tools—GitHub Copilot, Cursor, and Claude Code—directly into Axon Active's proprietary Scrum-based Axon Model™. The project produced the Axon AI Model™, a layered framework that reshapes developer roles into AI Pilots, Scrum Masters into AI-Enhanced Facilitators, and Product Owners into Value Engineers, with governance cycles spanning PO, EAT, and EMS levels. Research deliverables include a sales pitch for prospective clients, a 1000+ word strategic proposal for existing customers, and an internal staff guidebook featuring the 3-Prompt Rule and a Junior Gap apprenticeship solution. The enterprise governance layer addresses Private LLM policy, IP protection, and Copilot Enterprise rollout strategy across dedicated offshore teams.",
    "techStack": [
      "Python",
      "Claude API",
      "Notion API",
      "Google Drive API",
      "Anthropic SDK",
      "Markdown"
    ],
    "status": "Active",
    "category": "AI",
    "date": "2026-02-15",
    "githubUrl": "",
    "liveDemo": "",
    "thumbnail": "/images/axon-ai-thumb.svg",
    "screenshots": [
      "/images/axon-ai-1.svg",
      "/images/axon-ai-2.svg"
    ],
    "features": [
      "Axon AI Model™ framework defining role shifts for all Scrum personas (Developer → AI Pilot, SM → AI-Enhanced Facilitator, PO → Value Engineer)",
      "Agentic SDLC workflow mapping GitHub Copilot, Cursor, and Claude Code to each sprint phase",
      "Sales pitch and 1000+ word strategic proposal documents published and synchronized to Notion",
      "Internal staff guidebook: AI-First Onboarding, Pair Programming 2.0, and the 3-Prompt Rule",
      "Junior Gap solution: AI-assisted apprenticeship model bridging skill gaps for junior developers",
      "Enterprise governance layer: Private LLM policy, IP protection standards, and Copilot Enterprise adoption guidance"
    ],
    "featured": true
  },
  {
    "id": "4",
    "slug": "devday-2026",
    "title": "DevDay 2026",
    "shortDescription": "Vietnam's premier non-profit IT festival — AI x Human: Redefining Collaboration. April 18, 2026 at Duy Tan University, Da Nang.",
    "description": "<p><strong>DevDay Da Nang</strong> is Vietnam's premier non-profit information technology festival, organized annually by <strong>Axon Active</strong> and <strong>Duy Tan University</strong>. Founded in 2014, it has grown from a local developer meetup into one of Southeast Asia's most influential tech gatherings, attracting 3,000+ participants and 40+ international speakers each year.</p>\n\n<h3>DevDay 2026: AI x Human — Redefining Collaboration</h3>\n<p>Scheduled for <strong>April 18, 2026</strong> at Duy Tan University (03 Quang Trung, Da Nang), the 2026 edition centers on <em>\"AI x Human: Redefining Collaboration\"</em> — exploring how human creativity and machine intelligence work together rather than compete. DevDay positions AI as a collaborative partner that amplifies human potential, not a replacement.</p>\n\n<h3>Event Structure</h3>\n<p>The event runs 6 specialized concurrent tracks: <strong>AI &amp; Intelligent Systems</strong>, <strong>Web3 &amp; Blockchain</strong>, <strong>Software Engineering</strong>, <strong>Cybersecurity &amp; Data Protection</strong>, <strong>Enterprise Transformation</strong>, and <strong>Emerging Technologies</strong>. The program includes keynote sessions, hands-on workshops, startup pitch competitions, a career fair (50+ companies), and the legendary informal networking that defines the \"DevDay Spirit.\"</p>\n\n<h3>History &amp; Community Impact</h3>\n<p>DevDay celebrated its <strong>10-year anniversary in 2025</strong> with 3,000+ participants, 40 speakers, 38 session topics, 21 exhibitors, and 10 major sponsors. The event is backed by the Da Nang Department of Science &amp; Technology and has hosted delegations from the Swiss Confederation Embassy — evidence of its growing international reputation. Da Nang's position as Vietnam's rising technology hub outside Hanoi and HCMC is inseparable from DevDay's decade of community building.</p>\n\n<h3>AI Team Support</h3>\n<p>DevDay 2026 is supported by an AI planning team — <strong>Elsa</strong> (Strategic Orchestrator), <strong>Jarvis</strong> (Technical Specialist), and <strong>Anna</strong> (Content &amp; Research Coordinator) — working alongside Axon Active's human organizers to manage content curation, speaker research, and community documentation. This collaboration itself embodies the event's theme of human-AI co-intelligence in practice.</p>",
    "techStack": [
      "Notion API",
      "Google Calendar API",
      "Google Drive API",
      "OpenClaw",
      "Claude API"
    ],
    "status": "Active",
    "category": "Web",
    "date": "2026-02-15",
    "githubUrl": "",
    "liveDemo": "",
    "thumbnail": "/images/devday-2026-thumb.svg",
    "screenshots": [
      "/images/devday-2026-1.svg",
      "/images/devday-2026-2.svg"
    ],
    "features": [
      "Theme: \"AI x Human: Redefining Collaboration\" — April 18, 2026, Duy Tan University, Da Nang.",
      "Scale: 3,000+ attendees, 40+ international speakers, 21 exhibitors, 10 major sponsors (2025 benchmark).",
      "Program: 6 specialized tracks — AI/ML, Web3, Software Engineering, Cybersecurity, Enterprise Transformation, Emerging Tech.",
      "History: Founded 2014 by Axon Active & Duy Tan University — 11+ years of non-profit, community-driven innovation.",
      "Career Fair: 50+ companies recruiting AI-native developers, engineers, and product managers.",
      "AI Team: Elsa, Jarvis & Anna orchestrate planning, research, and content — a live demonstration of the event theme."
    ],
    "featured": true
  }
]